using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Translator
{
    public class LoadMain
    {
        
        public static string test()
        {
            string text1 = @"涡之国的最中央，坐落着整个国家中最大的宅院。

这里本是漩涡水户父亲的住所，在水户的父母死后，漩涡大木将其霸占，把自己那小得多的宅院让给了水户。

“都到齐了？”漩涡大木坐在幕帘后，阴沉地发问道。

他的脸上有着一道道纵横交错的疤痕，那凶狠的眼神让人感觉他根本笑不出来。资深一些的忍者，很容易就能感受到他身上那股血腥之气，是从尸山血海中累积出来的。

在幕帘之外，是一排排忍者整齐地单膝跪地。在宽广的房间里，聚集了数百人。

漩涡大木的亲信漩涡黑骨处在最前方，恭敬地道：“族长大人，33名精英上忍，75名上忍，以及433名中忍，已经全部召回完毕。”

“很好。”漩涡大木微微点头。

他这十多年来可不只是在族长的位子上作威作福，暗地里对自己势力的培养从来没落下过。目前涡之国大半的忍者，都是忠心于他的。

“漩涡水户那个黄毛丫头，最近有什么的特别的动向？”

漩涡黑骨不假思索地说道：“水户大小姐外出的时间比以往有所减少，推测应该是那位驸马的关系。除此之外，没有其他异状。”

“那个驸马……”漩涡大木回想起自己第一次见到君夜的场景，声音越发阴沉起来。

“虽然感知到他几乎没有查克拉，但无论怎么看，都不像是无名小卒。水户之前离开涡之国，以及现在宣布和他的关系……都证明了我的猜测——那个驸马野心不小！”

“那位驸马最近一直没有离开过住所。”漩涡黑骨尽责地汇报君夜的动向。

“没有离开是因为他怕我派人将其暗杀！”漩涡大木冷哼一声，“再怎么会哄女人，也不过是个胆小的弱者。”

“本想把漩涡水户当作筹码，和千手一族结姻的。既然那个不识好歹的东西，亲手把自己最后的价值给抹杀了，我也不必留她！”

“族长大人，我们需要怎么做？”漩涡黑骨问道。

“拖得越晚，我们的情报暴露的越多，他们也愈加防备。况且我等了十多年，已不想再等更久了！”

漩涡大木眼中杀意涌现，“今晚，包围漩涡水户的住所，一个人……都不要放过！”

至于这么做会有什么后果，漩涡大木并没有考虑。只要嫁祸给敌对的忍者家族就好了，愚民轻易就会相信的，哪怕不相信，也没人有实力反抗他！

“是！”漩涡黑骨应道。

就在漩涡大木的计划说明完毕，所有忍者准备退下之时……

“火遁·豪火灭却！”

巨大的火球直击屋顶，眨眼间就将屋顶击碎，冲向众位忍者。

“水遁·水龙弹！”

“水遁·水阵壁！”

“土遁·土流壁！”

“土遁·土龙弹！”

……

在场的忍者都经验十足，再见到巨大的火遁忍术攻来时，所有会使用水遁和土遁的忍者，都释放忍术抵挡。

虽然敌人的忍术看起来威力强大，但在场忍者会使用水遁或者土遁的，超过百位，所以对成功抵挡这一招都信心十足。

然后……

他们惊恐地发现，自己结了印甚至还喊了招式名……但忍术根本发动不出来！

大量的忍者都在措手不及中，被火球吞噬，烧成灰烬。

“轰！”

巨大的爆炸将这一片区域炸毁，熊熊的烈火四处蔓延，到处都是火光和黑烟。

漩涡大木看向一旁的角落，猛地扔出一支苦无。

“叮！”

君夜握着忍刀将苦无弹飞，慢悠悠地从阴影中站了出来。

“在这么乱的场面下，居然能发现我的存在，你这代理族长没有白当嘛。”

“是我小看你了，居然隐藏的这么深。”漩涡大木死死地盯着君夜那双拥有着奇妙纹样的血红色眼睛。

“宇智波一族，你们和千手一族打的还不够，竟敢与我漩涡一族为敌吗！”

宇智波一族远比漩涡一族强大，但有千手一族牵制，两族一直打得不分上下。任何一族加入战斗，都会使局面发生巨大的改变，这也是漩涡大木的信心所在。

哪怕知道君夜是宇智波一族的人，他也敢杀！

“你太碍眼了。”君夜看着漩涡大木，伸出两根手指，“给你两个选择，要么自杀，要么……我亲自动手。”

“你以为开了万花筒写轮眼就无敌了么！宇智波一族愚蠢的高傲，今天就将至你于死地。”

漩涡大木说话间，数百位幸存的忍者已经从那突如其来的一击中冷静下来，团团包围了君夜。

虽然漩涡大木嘴上说的很不屑一顾，但他对君夜的万花筒写轮眼显然很是戒备，不惜拿手下试探。

“生，是轮回的一部分。而你们的这部分，已然结束了。”君夜像看着渣滓一样，扫视着众位忍者。

“大言不惭！”漩涡大木大手一挥，“一起上，干掉他！哪怕不能使用忍术，他也只有一个人！”

君夜解开了【愚者世界】，迅速结印。

“火遁·豪火灭却！”

巨大的火球再一次出现，从一条直线上将大量的忍者击杀。

而君夜在施展完忍术后，立刻开启了【愚者世界】。

“原来如此，封印别人忍术的能力吗。”漩涡大木看君夜成功施展了忍术，自己立刻又尝试了一次……结果发现忍术依旧无法发动。

他自以为是地，给君夜的万花筒写轮眼能力下了判断。

“听好了，他的万花筒写轮眼能封印我们的忍术，全部都给我用体术和刃具攻击，不要做无谓的尝试！如此强的能力，弱点一定是持续时间短暂，等到他眼睛撑不住了就是我们的胜利！”

漩涡大木大声说道，指挥手下忍者的同时，完全没打算亲自上场。

他族长级的实力，大部分都在忍术上。光看体术的话，甚至一些手下都比他强，何必冒险上去参与战斗呢。

————————————

PS：原著中第四次忍界大战，五大国+铁之国组成的忍者联军约八万人。

考虑到战国时代死的人比较多，涡之国也只是个小国，所有中忍到精英上忍的总人数在一千以内比较合理。（虽然同人小说本身就不是什么合理的东西啦~）

";
            TranslatorEngine.TranslatorEngine.LoadDictionaries();
            string result = TranslatorEngine.TranslatorEngine.ChineseToVietPhraseOneMeaningForBatch(text1, 0,2,true);
            return result;
            
        }

    }
}
